print("==========A=========")
#טענת כניסה - איזה פרמטרים הפונקציה מקבלת 
#טענת יציאה - מה הפונקציה עושה 
#טענת הכניסה - מקבלת פרמטר מסוג סטרינג המייצג שם 
#טענת היציאה: הפונקציה מדפיסה את השם עטוף ב - ====
def print_name(name):
    print(f"======={name}=====")
#זימון הפונקציה קוראים לה בשמה ומשנים את מה שבסוגריים
print_name("david")
print_name("hello")


print("==========B=========")
#טענת כניסה - הפוקנציה לא מקבלת פרמטרים  
#טענת יציאה - הפונקציה מוציא את השם שרושמים לה עם = 
def printname():
    print(f"======hello======")
print()

