def even_odd_even(n): # 3-2-7-4
    new_n = str(n)    #  שלוש ושתיים זה אינדקס אחד, שתיים ושבע זה אינדקס אחד, וכן הלאה אז בגלל זה מחסירים במינוס אחד שלא יעבור על 4 כשצריך 3 אינדקסים כי הוא משווה בין שתי אינדקסים 
    for i in range(len(new_n) - 1):# עובר על כל האינדקסים עד הלפני אחרון
        if int(new_n[i]) % 2 == int(new_n[i + 1]) % 2:#אם שניהם מתחלקים אז מחזיר שקר
                                                    #אם שניהם גם לא מתחלקים מחזיר שקר 
                                                     # משווה את התו הנוכחי עם התו הבא אחריו
            return False# אם שניהם זוגיים או שניהם אי-זוגיים, מחזיר False
    return True
