'''
back - מכניסים את הפונקציות שעובדים איתם 
'''
def factor_grade(grade):
    if grade < 0 or grade > 100:
        '''
        raise -  זה בשבילינו שנראה אם טעינו בפונקציה וזה יסיים איפה שיש אותה ומחזיר את הבעיה ל err
        return  - מחזיר את מה שאומרים לו שיחזיר לפונקציה 
            כמו ריטרן עוצר את הפונקציה 
            ושולח את הבעיה לתוך מה שהשוונו את הווליו ארור באפ
        '''
        raise ValueError ("!!!!error out of range!!!!") #אנחנו צריכים לחשוב על הטעויות שיהיו בעצמנו 
    grade += 10
    if grade > 100:
        grade = 100
    return grade